In [ ]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

In [ ]:
train = pd.read_csv('Training.csv')
test = pd.read_csv('sample_submission.csv')

pre= pd.read_csv('Matches IPL 2008-2019.csv')
coming =pd.read_csv('Matches IPL 2020.csv')

In [ ]:
train.head()

                Id  Runs  Boundaries  ...  Maidens  Bowling_Points  Total Points
0   1_Bipul Sharma     0           0  ...        0              25            25
1       1_DJ Hooda    16           1  ...        0              25            44
2      1_KM Jadhav    31           5  ...        0               0            38
3  1_Mandeep Singh    24           5  ...        0               0            29
4   1_Yuvraj Singh    62          10  ...        0               0            86

[5 rows x 14 columns]

In [ ]:
train['player'] = train['Id']
train['match_id'] =  train['Id']
for i in range(0, len( train)):
    train['player'][i] =  train['Id'][i].split("_")[-1]
    train['match_id'][i] = int( train['Id'][i].split('_')[:1][0])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [ ]:
train_df=train[['Id', 'player', 'Total Points', 'match_id']]
train_df.head()

                Id         player  Total Points match_id
0   1_Bipul Sharma   Bipul Sharma            25        1
1       1_DJ Hooda       DJ Hooda            44        1
2      1_KM Jadhav      KM Jadhav            38        1
3  1_Mandeep Singh  Mandeep Singh            29        1
4   1_Yuvraj Singh   Yuvraj Singh            86        1

In [ ]:
test['player'] = test['Id']
test['match_id'] =  test['Id']
for i in range(0, len( test)):
    test['player'][i] =  test['Id'][i].split("_")[-1]
    test['match_id'][i] = int( test['Id'][i].split('_')[:1][0])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [ ]:
test.head()

                     Id  Total Points        player match_id
0      1216492_AS Yadav             0      AS Yadav  1216492
1     1216492_AT Rayudu             0     AT Rayudu  1216492
2     1216492_DL Chahar             0     DL Chahar  1216492
3  1216492_F du Plessis             0  F du Plessis  1216492
4     1216492_HH Pandya             0     HH Pandya  1216492

In [ ]:
pre=pre[['match_id', 'team1', 'team2', 'season']]
pre.head()

   match_id                  team1                        team2  season
0        60  Kolkata Knight Riders  Royal Challengers Bangalore    2008
1        61    Chennai Super Kings              Kings XI Punjab    2008
2        62       Rajasthan Royals             Delhi Daredevils    2008
3        63         Mumbai Indians  Royal Challengers Bangalore    2008
4        64        Deccan Chargers        Kolkata Knight Riders    2008

In [ ]:
coming=coming[['match_id', 'team1', 'team2']]
coming.head()

   match_id team1 team2
0   1216492    MI   CSK
1   1216493    DC  KXIP
2   1216534   SRH   RCB
3   1216496    RR   CSK
4   1216508   KKR    MI

In [ ]:
train_df = pd.merge(train_df,pre, how = 'inner', on = 'match_id')
train_df.head()

                Id         player  ...                        team2 season
0   1_Bipul Sharma   Bipul Sharma  ...  Royal Challengers Bangalore   2017
1       1_DJ Hooda       DJ Hooda  ...  Royal Challengers Bangalore   2017
2      1_KM Jadhav      KM Jadhav  ...  Royal Challengers Bangalore   2017
3  1_Mandeep Singh  Mandeep Singh  ...  Royal Challengers Bangalore   2017
4   1_Yuvraj Singh   Yuvraj Singh  ...  Royal Challengers Bangalore   2017

[5 rows x 7 columns]

In [ ]:
test = pd.merge(test,coming, how = 'inner', on = 'match_id')
test.head()

                     Id  Total Points        player match_id team1 team2
0      1216492_AS Yadav             0      AS Yadav  1216492    MI   CSK
1     1216492_AT Rayudu             0     AT Rayudu  1216492    MI   CSK
2     1216492_DL Chahar             0     DL Chahar  1216492    MI   CSK
3  1216492_F du Plessis             0  F du Plessis  1216492    MI   CSK
4     1216492_HH Pandya             0     HH Pandya  1216492    MI   CSK

In [ ]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [ ]:




train_df.team1 = le.fit_transform(train_df.team1)
train_df.team2 = le.fit_transform(train_df.team2)

In [ ]:
train_df.head()

                Id         player  Total Points match_id  team1  team2  season
0   1_Bipul Sharma   Bipul Sharma            25        1     14     13    2017
1       1_DJ Hooda       DJ Hooda            44        1     14     13    2017
2      1_KM Jadhav      KM Jadhav            38        1     14     13    2017
3  1_Mandeep Singh  Mandeep Singh            29        1     14     13    2017
4   1_Yuvraj Singh   Yuvraj Singh            86        1     14     13    2017

In [ ]:
X=train_df[['team1', 'team2']]
y=train_df['Total Points']

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error



from sklearn.linear_model import LinearRegression
from sklearn.model_selection import GridSearchCV ,RandomizedSearchCV
from sklearn.tree import plot_tree


from sklearn.ensemble import RandomForestRegressor,AdaBoostRegressor,GradientBoostingRegressor
from sklearn.tree import DecisionTreeRegressor
from sklearn.svm import SVR

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.1, random_state=42)

In [ ]:
#import models
lg = LinearRegression()
svr = SVR()
dt = DecisionTreeRegressor( criterion="friedman_mse", splitter= 'random')
rf = RandomForestRegressor()
ada = AdaBoostRegressor()
gb = GradientBoostingRegressor()


#fit model in train data
lg.fit(X_train,y_train)
svr.fit(X_train,y_train)
dt.fit(X_train,y_train)
rf.fit(X_train,y_train)
ada.fit(X_train,y_train)
gb.fit(X_train,y_train)



#predict test data
lg_pred = lg.predict(X_test) 
svr_pred = svr.predict(X_test) 
dt_pred = dt.predict(X_test) 
rf_pred = rf.predict(X_test) 
ada_pred = ada.predict(X_test) 
gb_pred = gb.predict(X_test) 



# measure the errors
lg_RMSE = np.sqrt(mean_squared_error(y_test,lg_pred))
svr_RMSE = np.sqrt(mean_squared_error(y_test,svr_pred))
dt_RMSE = np.sqrt(mean_squared_error(y_test,dt_pred))
rf_RMSE = np.sqrt(mean_squared_error(y_test,rf_pred))
ada_RMSE = np.sqrt(mean_squared_error(y_test,ada_pred))
gb_RMSE = np.sqrt(mean_squared_error(y_test,gb_pred))



#rmse of models
print('lg_RMSE',lg_RMSE)
print('svr_RMSE',svr_RMSE)
print('dt_RMSE',dt_RMSE)
print('rf_RMSE',rf_RMSE)
print('ada_RMSE',ada_RMSE)
print('gb_RMSE',gb_RMSE)

lg_RMSE 29.730777258455234
svr_RMSE 30.07530826547908
dt_RMSE 29.99078607336608
rf_RMSE 29.98992072861955
ada_RMSE 33.140662085533094
gb_RMSE 29.82455016744771

In [ ]:
test.team1 = le.fit_transform(test.team1)
test.team2 = le.fit_transform(test.team2)

In [ ]:
df = train_df.append(test, ignore_index=True)

In [ ]:
df_Train=df.iloc[:15916,:]
df_Test=df.iloc[15916:,:]

In [ ]:
df_Train.drop(['Id', 'player', 'match_id', 'season'],axis=1,inplace=True)

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [ ]:
df_Train.head()

   Total Points  team1  team2
0            25     14     13
1            44     14     13
2            38     14     13
3            29     14     13
4            86     14     13

In [ ]:
df_Test.head()

                         Id        player  Total Points  ... team1  team2  season
15916      1216492_AS Yadav      AS Yadav             0  ...     4      0     NaN
15917     1216492_AT Rayudu     AT Rayudu             0  ...     4      0     NaN
15918     1216492_DL Chahar     DL Chahar             0  ...     4      0     NaN
15919  1216492_F du Plessis  F du Plessis             0  ...     4      0     NaN
15920     1216492_HH Pandya     HH Pandya             0  ...     4      0     NaN

[5 rows x 7 columns]

In [ ]:
df_Test.drop(['Id', 'player', 'Total Points', 'match_id', 'season'],axis=1,inplace=True)

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [ ]:
df_Test.head()

       team1  team2
15916      4      0
15917      4      0
15918      4      0
15919      4      0
15920      4      0

In [ ]:
X_train=df_Train.drop(['Total Points'],axis=1)
y_train=df_Train['Total Points']

In [ ]:
lg.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
y_pred=lg.predict(df_Test)

In [ ]:
y_pred.shape

(1283,)

In [ ]:
y_pred

array([30.27684895, 30.27684895, 30.27684895, ..., 30.07900446,
       30.07900446, 30.07900446])

In [ ]:
sub=pd.DataFrame(y_pred)
submission=pd.concat([test['Id'],sub],axis=1)
submission.columns=['Id','Total Points']

In [ ]:
submission.to_csv('predict.csv',index=False)

In [ ]:
submission.tail()

                     Id  Total Points
1278  1237181_S Hetmyer     30.079004
1279   1237181_SA Yadav     30.079004
1280    1237181_SS Iyer     30.079004
1281  1237181_SS Tiwary     30.079004
1282   1237181_TA Boult     30.079004